package com.crimeasos.java.course.fourth;

/**
 * Created by Паша on 05.12.2015.
 * Інтерфейс Speaking -  описує речовий модуль.
 * Інтерфейс - це схожа на клас сутність , але на відміну від класу -
 * 1. описує методи, але не має їх реалізації, може мати змінні
 * 2. всі методи і змінні інтерфейсу по замовчуванню публічні
 * Всі класи, які імплементують інтерфейс Speaking   обов'язково мають
 * мати реалізацію всіх методів
 */
public interface Speaking {

    /**
     * цей метод по замовчуванню public
     * @param text
     */
    void speak(String text);
}
